# TextureVRepeat Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient..::..TextureVRepeat Property
Gradient Class See Also
---
The property labeled "V Repeat" from the "Gradient" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TextureVRepeat { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureVRepeat As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureVRepeat {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace